7767517
238 282
Input            images                   0 1 images
Convolution      167                      1 1 images 167 0=32 1=6 11=6 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=3456
Swish            169                      1 1 167 169
Convolution      170                      1 1 169 170 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=18432
Swish            172                      1 1 170 172
Split            splitncnn_0              1 2 172 172_splitncnn_0 172_splitncnn_1
Convolution      173                      1 1 172_splitncnn_1 173 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Swish            175                      1 1 173 175
Split            splitncnn_1              1 2 175 175_splitncnn_0 175_splitncnn_1
Convolution      176                      1 1 175_splitncnn_1 176 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Swish            178                      1 1 176 178
Convolution      179                      1 1 178 179 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
Swish            181                      1 1 179 181
BinaryOp         182                      2 1 175_splitncnn_0 181 182 0=0
Convolution      183                      1 1 172_splitncnn_0 183 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Swish            185                      1 1 183 185
Concat           186                      2 1 182 185 186 0=0
Convolution      187                      1 1 186 187 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            189                      1 1 187 189
Convolution      190                      1 1 189 190 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=73728
Swish            192                      1 1 190 192
Split            splitncnn_2              1 2 192 192_splitncnn_0 192_splitncnn_1
Convolution      193                      1 1 192_splitncnn_1 193 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Swish            195                      1 1 193 195
Split            splitncnn_3              1 2 195 195_splitncnn_0 195_splitncnn_1
Convolution      196                      1 1 195_splitncnn_1 196 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            198                      1 1 196 198
Convolution      199                      1 1 198 199 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            201                      1 1 199 201
BinaryOp         202                      2 1 195_splitncnn_0 201 202 0=0
Split            splitncnn_4              1 2 202 202_splitncnn_0 202_splitncnn_1
Convolution      203                      1 1 202_splitncnn_1 203 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            205                      1 1 203 205
Convolution      206                      1 1 205 206 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            208                      1 1 206 208
BinaryOp         209                      2 1 202_splitncnn_0 208 209 0=0
Split            splitncnn_5              1 2 209 209_splitncnn_0 209_splitncnn_1
Convolution      210                      1 1 209_splitncnn_1 210 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            212                      1 1 210 212
Convolution      213                      1 1 212 213 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            215                      1 1 213 215
BinaryOp         216                      2 1 209_splitncnn_0 215 216 0=0
Convolution      217                      1 1 192_splitncnn_0 217 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Swish            219                      1 1 217 219
Concat           220                      2 1 216 219 220 0=0
Convolution      221                      1 1 220 221 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            223                      1 1 221 223
Split            splitncnn_6              1 2 223 223_splitncnn_0 223_splitncnn_1
Convolution      224                      1 1 223_splitncnn_1 224 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=294912
Swish            226                      1 1 224 226
Split            splitncnn_7              1 2 226 226_splitncnn_0 226_splitncnn_1
Convolution      227                      1 1 226_splitncnn_1 227 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            229                      1 1 227 229
Split            splitncnn_8              1 2 229 229_splitncnn_0 229_splitncnn_1
Convolution      230                      1 1 229_splitncnn_1 230 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            232                      1 1 230 232
Convolution      233                      1 1 232 233 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            235                      1 1 233 235
BinaryOp         236                      2 1 229_splitncnn_0 235 236 0=0
Split            splitncnn_9              1 2 236 236_splitncnn_0 236_splitncnn_1
Convolution      237                      1 1 236_splitncnn_1 237 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            239                      1 1 237 239
Convolution      240                      1 1 239 240 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            242                      1 1 240 242
BinaryOp         243                      2 1 236_splitncnn_0 242 243 0=0
Split            splitncnn_10             1 2 243 243_splitncnn_0 243_splitncnn_1
Convolution      244                      1 1 243_splitncnn_1 244 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            246                      1 1 244 246
Convolution      247                      1 1 246 247 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            249                      1 1 247 249
BinaryOp         250                      2 1 243_splitncnn_0 249 250 0=0
Convolution      251                      1 1 226_splitncnn_0 251 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            253                      1 1 251 253
Concat           254                      2 1 250 253 254 0=0
Convolution      255                      1 1 254 255 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            257                      1 1 255 257
Split            splitncnn_11             1 2 257 257_splitncnn_0 257_splitncnn_1
Convolution      258                      1 1 257_splitncnn_1 258 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1179648
Swish            260                      1 1 258 260
Split            splitncnn_12             1 2 260 260_splitncnn_0 260_splitncnn_1
Convolution      261                      1 1 260_splitncnn_1 261 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            263                      1 1 261 263
Split            splitncnn_13             1 2 263 263_splitncnn_0 263_splitncnn_1
Convolution      264                      1 1 263_splitncnn_1 264 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            266                      1 1 264 266
Convolution      267                      1 1 266 267 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
Swish            269                      1 1 267 269
BinaryOp         270                      2 1 263_splitncnn_0 269 270 0=0
Convolution      271                      1 1 260_splitncnn_0 271 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            273                      1 1 271 273
Concat           274                      2 1 270 273 274 0=0
Convolution      275                      1 1 274 275 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
Swish            277                      1 1 275 277
Convolution      278                      1 1 277 278 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            280                      1 1 278 280
Split            splitncnn_14             1 2 280 280_splitncnn_0 280_splitncnn_1
Pooling          281                      1 1 280_splitncnn_1 281 0=0 1=5 11=5 2=1 12=1 3=2 13=2 14=2 15=2 5=1
Split            splitncnn_15             1 2 281 281_splitncnn_0 281_splitncnn_1
Pooling          282                      1 1 281_splitncnn_1 282 0=0 1=5 11=5 2=1 12=1 3=2 13=2 14=2 15=2 5=1
Split            splitncnn_16             1 2 282 282_splitncnn_0 282_splitncnn_1
Pooling          283                      1 1 282_splitncnn_1 283 0=0 1=5 11=5 2=1 12=1 3=2 13=2 14=2 15=2 5=1
Concat           284                      4 1 280_splitncnn_0 281_splitncnn_0 282_splitncnn_0 283 284 0=0
Convolution      285                      1 1 284 285 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=524288
Swish            287                      1 1 285 287
Convolution      288                      1 1 287 288 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            290                      1 1 288 290
Split            splitncnn_17             1 2 290 290_splitncnn_0 290_splitncnn_1
Interp           295                      1 1 290_splitncnn_1 295 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           296                      2 1 295 257_splitncnn_0 296 0=0
Split            splitncnn_18             1 2 296 296_splitncnn_0 296_splitncnn_1
Convolution      297                      1 1 296_splitncnn_1 297 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            299                      1 1 297 299
Convolution      300                      1 1 299 300 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            302                      1 1 300 302
Convolution      303                      1 1 302 303 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            305                      1 1 303 305
Convolution      306                      1 1 296_splitncnn_0 306 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            308                      1 1 306 308
Concat           309                      2 1 305 308 309 0=0
Convolution      310                      1 1 309 310 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            312                      1 1 310 312
Convolution      313                      1 1 312 313 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            315                      1 1 313 315
Split            splitncnn_19             1 2 315 315_splitncnn_0 315_splitncnn_1
Interp           320                      1 1 315_splitncnn_1 320 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           321                      2 1 320 223_splitncnn_0 321 0=0
Split            splitncnn_20             1 3 321 321_splitncnn_0 321_splitncnn_1 321_splitncnn_2
Convolution      322                      1 1 321_splitncnn_2 322 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            324                      1 1 322 324
Convolution      325                      1 1 324 325 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            327                      1 1 325 327
Convolution      328                      1 1 327 328 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            330                      1 1 328 330
Convolution      331                      1 1 321_splitncnn_1 331 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            333                      1 1 331 333
Concat           334                      2 1 330 333 334 0=0
Convolution      335                      1 1 334 335 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            337                      1 1 335 337
Split            splitncnn_21             1 2 337 337_splitncnn_0 337_splitncnn_1
Convolution      338                      1 1 337_splitncnn_1 338 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            340                      1 1 338 340
Concat           341                      2 1 340 315_splitncnn_0 341 0=0
Split            splitncnn_22             1 3 341 341_splitncnn_0 341_splitncnn_1 341_splitncnn_2
Convolution      342                      1 1 341_splitncnn_2 342 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            344                      1 1 342 344
Convolution      345                      1 1 344 345 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            347                      1 1 345 347
Convolution      348                      1 1 347 348 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            350                      1 1 348 350
Convolution      351                      1 1 341_splitncnn_1 351 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            353                      1 1 351 353
Concat           354                      2 1 350 353 354 0=0
Convolution      355                      1 1 354 355 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            357                      1 1 355 357
Split            splitncnn_23             1 2 357 357_splitncnn_0 357_splitncnn_1
Convolution      358                      1 1 357_splitncnn_1 358 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=589824
Swish            360                      1 1 358 360
Concat           361                      2 1 360 290_splitncnn_0 361 0=0
Split            splitncnn_24             1 3 361 361_splitncnn_0 361_splitncnn_1 361_splitncnn_2
Convolution      362                      1 1 361_splitncnn_2 362 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            364                      1 1 362 364
Convolution      365                      1 1 364 365 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            367                      1 1 365 367
Convolution      368                      1 1 367 368 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
Swish            370                      1 1 368 370
Convolution      371                      1 1 361_splitncnn_1 371 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            373                      1 1 371 373
Concat           374                      2 1 370 373 374 0=0
Convolution      375                      1 1 374 375 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
Swish            377                      1 1 375 377
Convolution      378                      1 1 321_splitncnn_0 378 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            380                      1 1 378 380
Convolution      381                      1 1 341_splitncnn_0 381 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            383                      1 1 381 383
Interp           388                      1 1 383 388 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=1
Convolution      389                      1 1 361_splitncnn_0 389 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            391                      1 1 389 391
Interp           396                      1 1 391 396 0=2 1=4.000000e+00 2=4.000000e+00 3=0 4=0 6=1
Concat           397                      3 1 380 388 396 397 0=0
Split            splitncnn_25             1 2 397 397_splitncnn_0 397_splitncnn_1
Convolution      398                      1 1 397_splitncnn_1 398 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
Swish            400                      1 1 398 400
Convolution      401                      1 1 400 401 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
Swish            403                      1 1 401 403
Split            splitncnn_26             1 2 403 403_splitncnn_0 403_splitncnn_1
Convolution      404                      1 1 403_splitncnn_1 404 0=96 1=3 11=3 2=2 12=2 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=82944
BatchNorm        405                      1 5 404 405 406 407 batch_norm_dead_output-1124 batch_norm_dead_output-1125 0=96
Swish            411                      1 1 405 411
Split            splitncnn_27             1 2 411 411_splitncnn_0 411_splitncnn_1
Convolution      412                      1 1 411_splitncnn_1 412 0=96 1=3 11=3 2=3 12=3 3=1 13=1 4=3 14=3 15=3 16=3 5=0 6=82944
BatchNorm        413                      1 5 412 413 414 415 batch_norm_dead_output-1147 batch_norm_dead_output-1148 0=96
Swish            419                      1 1 413 419
Split            splitncnn_28             1 2 419 419_splitncnn_0 419_splitncnn_1
Pooling          420                      1 1 419_splitncnn_1 420 0=1 4=1
Convolution      421                      1 1 420 421 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
Swish            423                      1 1 421 423
Interp           442                      1 1 423 442 0=1 1=1.000000e+00 2=1.000000e+00 3=80 4=80 6=0
Concat           443                      4 1 403_splitncnn_0 411_splitncnn_0 419_splitncnn_0 442 443 0=0
Convolution      444                      1 1 443 444 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=49152
Swish            446                      1 1 444 446
Convolution      447                      1 1 397_splitncnn_0 447 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Swish            449                      1 1 447 449
Split            splitncnn_29             1 3 449 449_splitncnn_0 449_splitncnn_1 449_splitncnn_2
Pooling          454                      1 1 449_splitncnn_2 454 0=1 1=4 11=4 2=4 12=4 3=0 13=0 14=0 15=0 5=1 6=0
Convolution      455                      1 1 454 455 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=320
Swish            457                      1 1 455 457
Interp           470                      1 1 457 470 0=2 1=1.000000e+00 2=1.000000e+00 3=80 4=80 6=1
Pooling          473                      1 1 449_splitncnn_1 473 0=1 1=3 11=3 2=3 12=3 3=0 13=0 14=0 15=0 5=1 6=0
Convolution      474                      1 1 473 474 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=320
Swish            476                      1 1 474 476
Interp           489                      1 1 476 489 0=2 1=1.000000e+00 2=1.000000e+00 3=80 4=80 6=1
Padding          491                      1 1 449_splitncnn_0 491 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00 7=0 8=0
Pooling          492                      1 1 491 492 0=1 1=3 11=3 2=3 12=3 3=0 13=0 14=0 15=0 5=1 6=0
Convolution      493                      1 1 492 493 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=320
Swish            495                      1 1 493 495
Interp           508                      1 1 495 508 0=2 1=1.000000e+00 2=1.000000e+00 3=80 4=80 6=1
Concat           510                      4 1 446 470 489 508 510 0=0
Convolution      511                      1 1 510 511 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=182016
Swish            513                      1 1 511 513
Split            splitncnn_30             1 3 513 513_splitncnn_0 513_splitncnn_1 513_splitncnn_2
Pooling          514                      1 1 513_splitncnn_2 514 0=1 4=1
Convolution      515                      1 1 514 515 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
Swish            517                      1 1 515 517
Convolution      518                      1 1 517 518 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
Sigmoid          519                      1 1 518 519
BinaryOp         520                      2 1 513_splitncnn_1 519 520 0=2
BinaryOp         521                      2 1 520 513_splitncnn_0 521 0=0
Convolution      522                      1 1 521 522 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Interp           output_se                1 1 522 output_se 0=2 1=8.000000e+00 2=8.000000e+00 3=0 4=0 6=1
Convolution      528                      1 1 337_splitncnn_0 528 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Reshape          540                      1 1 528 540 0=-1 1=12 2=3
Permute          output_de_80             1 1 540 output_de_80 0=1
Convolution      542                      1 1 357_splitncnn_0 542 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
Reshape          554                      1 1 542 554 0=-1 1=12 2=3
Permute          output_de_40             1 1 554 output_de_40 0=1
Convolution      556                      1 1 377 556 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18432
Reshape          568                      1 1 556 568 0=-1 1=12 2=3
Permute          output_de_20             1 1 568 output_de_20 0=1
